DataProcessors/APPLIX_RU_СМ_Регистрация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>APPLIX_RU_СМ_Регистрация</Name>
			<Comment>6.0</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКлюча</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременныйКлюч</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ХранилищеНастроекПрограммы</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_КлючАктивации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ОписаниеЛицензии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ИмяКонстанты</Name>
					<Comment>константа в которую сохранить ключ активации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_Обработка_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_ЭлПочтаПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_КЭШ</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Р_РежимОткрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/APPLIX_RU_СМ_Регистрация/Forms/ФормаУпр/Ext/Form/Module.bsl
&НаСервере
Перем ОбработкаОбъект;

// ОБЪЕКТ //////////////////////////////////////////////////////////////////////////

//---------------------------------------------------------------------------------------------------------------------------------------
&НаСервере
Функция Объект_ИнициализироватьОбработку(Обновить=Ложь)
	Если (ОбработкаОбъект=Неопределено) или (Обновить) Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
КонецФункции


&НаКлиенте
Функция Объект_ОткрытьФормуОбработки(ИмяФормы, ФормаПараметры=Неопределено, ФормаВладелец=Неопределено, Модально=Истина)
	
	Если Модально Тогда
		Попытка
			Ответ = ОткрытьФормуМодально("ВнешняяОбработка."+Объект.Р_Обработка_Имя+".Форма."+ИмяФормы,ФормаПараметры,ЭтаФорма);
		Исключение
			Ответ = ОткрытьФормуМодально("Обработка."+Объект.Р_Обработка_Имя+".Форма."+ИмяФормы,ФормаПараметры,ЭтаФорма);
		КонецПопытки;
	Иначе
		Попытка
			Ответ = ОткрытьФорму("ВнешняяОбработка."+Объект.Р_Обработка_Имя+".Форма."+ИмяФормы,ФормаПараметры,ЭтаФорма);
		Исключение
			Ответ = ОткрытьФорму("Обработка."+Объект.Р_Обработка_Имя+".Форма."+ИмяФормы,ФормаПараметры,ЭтаФорма);
		КонецПопытки;
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции


//---------------------------------------------------------------------------------------------------------------------------------------
&НаКлиенте
Функция Объект_УстановитьЗаголовок()
	Если РФ_РежимОткрытия = "СчетНаОплату" Тогда
		ЭтаФорма.Заголовок = "Запрос счета на оплату подписки ["+Объект.ИД+"]";
	Иначе
		ЭтаФорма.Заголовок = "Регистрация программы ["+Объект.ИД+"]";
	КонецЕсли;
КонецФункции

//---------------------------------------------------------------------------------------------------------------------------------------
&НаКлиенте
Функция Объект_ЗагрузитьКлюч(Эл="")
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Д.Фильтр = "Файлы ключей активации для программ applix.ru|*.apxkey";
	Если Д.Выбрать() Тогда
		ФайлКлюча = Д.ПолноеИмяФайла;
		Т = Новый ТекстовыйДокумент;
		т.Прочитать(ФайлКлюча);
		КлючАктивации = т.ПолучитьТекст();
		Успешно = Истина;
		//Если ЗначениеЗаполнено(Объект.Р_ХранилищеНастроекПрограммы) Тогда 
			//Сообщить(КлючАктивации);
			Оповестить("APPLIX_RU_АктивацияПрограммы"+Объект.ИД, КлючАктивации, ЭтаФорма);
			Успешно = Команда_ЗагрузитьЛицензионныйКлюч_ЗаписатьКлючВХранилище(КлючАктивации); //сохраняем в константу
		//КонецЕсли;
		
		Если Успешно Тогда 
			ЭтаФорма.Закрыть(Истина);
		КонецЕсли;
	КонецЕсли;
	
	Объект_УстановитьВидимостьЭлементов();
КонецФункции

//---------------------------------------------------------------------------------------------------------------------------------------
&НаКлиенте
Функция Объект_УстановитьВидимостьЭлементов(Эл="")
	Если ЗначениеЗаполнено(Объект.Р_ЭлПочтаПокупателя) Тогда
		Элементы.ПолеКартинки_Заказ.Картинка = Элементы.ПолеКартинки_ФлагУстановлен.Картинка;
	Иначе
		Элементы.ПолеКартинки_Заказ.Картинка = Элементы.ПолеКартинки_ФлагНеУстановлен.Картинка;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.ПолеКартинки_Организация.Картинка = Элементы.ПолеКартинки_ФлагУстановлен.Картинка;
	Иначе
		Элементы.ПолеКартинки_Организация.Картинка = Элементы.ПолеКартинки_ФлагНеУстановлен.Картинка;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.КодРегистрации) Тогда
		Элементы.ПолеКартинки_КодРегистрации.Картинка = Элементы.ПолеКартинки_ФлагУстановлен.Картинка;
	Иначе
		Элементы.ПолеКартинки_КодРегистрации.Картинка = Элементы.ПолеКартинки_ФлагНеУстановлен.Картинка;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ФайлКлюча) Тогда
		Элементы.ПолеКартинки_КлючАктивации.Картинка = Элементы.ПолеКартинки_ФлагУстановлен.Картинка;
	Иначе
		Элементы.ПолеКартинки_КлючАктивации.Картинка = Элементы.ПолеКартинки_ФлагНеУстановлен.Картинка;
	КонецЕсли;
	
	Элементы.Команда_ОткрытьКаталог.Видимость = ЗначениеЗаполнено(Объект.ФайлРегистрации);
КонецФункции


&НаКлиенте
Функция Объект_ПоказатьПомощь(РазделПомощи, ТекстПодсказки="")
	ПараметрыПередачи = Новый Структура();
	ПараметрыПередачи.Вставить("Раздел", РазделПомощи);
	ПараметрыПередачи.Вставить("ТекстПодсказки", ТекстПодсказки);
	
	Объект_ОткрытьФормуОбработки("ФормаУпр_Помощь", ПараметрыПередачи, , Ложь);
КонецФункции


&НаКлиенте
Функция Объект_ОтправитьКлюч_Клиент(Эл="")
	Если Не ЗначениеЗаполнено(Объект.ИД) Тогда 
		Объект_СообщениеПользователю("Не удалось сформировать файл регистрации. Отключите защиту от опасных действий по инструкции и повторите регистрацию.", Истина, 7);
		Возврат Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Р_ЭлПочтаПокупателя) Тогда 
		Объект_СообщениеПользователю("Укажите email указанный при оформлении заказа", Истина, 7);
		Возврат Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда 
		Объект_СообщениеПользователю("Укажите организацию", Истина, 7);
		Возврат Ложь;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект_ПолучитьИННОрганизации_Сервер()) Тогда
		Объект_СообщениеПользователю("Укажите ИНН выбранной организации. Код не сформирован.", Истина, 7);
		Возврат Ложь;
	КонецЕсли;
	
	ПолноеИмяФайла = КаталогВременныхФайлов() + Объект_СформироватьИмяФайлаРегистрации_Сервер();
	
	////Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	////Д.Фильтр = "Файлы регистрации программ applix.ru|*.apxreg";
	////Если ЗначениеЗаполнено(Объект.ФайлРегистрации) Тогда 
	////	Д.ПолноеИмяФайла = Объект.ФайлРегистрации;
	////Иначе 
	////	Д.ПолноеИмяФайла = Объект_СформироватьИмяФайлаРегистрации_Сервер();
	////КонецЕсли;
	////
	////Если Д.Выбрать() Тогда
		Объект.ФайлРегистрации = ПолноеИмяФайла;
		
		//СформироватьКодРегистрации();		
		Объект_СформироватьФайлРегистрации_Сервер();
		
		тКод = Новый ТекстовыйДокумент;
		тКод.УстановитьТекст(Объект.КодРегистрации);
		тКод.Записать(Объект.ФайлРегистрации, КодировкаТекста.UTF8);
		
		Отправлен = Объект_ОтправитьКлюч_Сервер();
		Если Отправлен=Истина Тогда
			т = "Ключ регистрации успешно отправлен разработчику.";
			т = т + Символы.ПС + "В ближайшее время на Ваш Email, указанный при заказе программы, придет ключ активации.";
			т = т + Символы.ПС + "Срок доставки ключа активации - от нескольких минут до трех дней, если регистрация проводится в нерабочее время.";
			т = т + Символы.ПС + "Окно регистрации можно пока закрыть.";
			Объект_СообщениеПользователю(т);
		Иначе
			т = "Не удалось отправить файл регистрации автоматически.";
			т = т + Символы.ПС + "Отправьте этот файл самостоятельно на Email разработчика.";
			т = т + Символы.ПС + Объект.ФайлРегистрации;
			Объект_СообщениеПользователю(т, Истина);
		КонецЕсли;
	////КонецЕсли;
	
	Объект_УстановитьВидимостьЭлементов();
	
	Возврат Истина;
КонецФункции

//---------------------------------------------------------------------------------------------------------------------------------------
Функция Объект_ОтправитьКлюч_Сервер()
	Рез = Ложь;
	
	Объект_ИнициализироватьОбработку(Истина);
	
	Рез = ОбработкаОбъект.Объект_ОтправитьКлюч();
	
	Возврат Рез;
КонецФункции


//---------------------------------------------------------------------------------------------------------------------------------------
&НаКлиенте
Функция Объект_ОтправитьЗапросНаСчет(Команда="")
	Если Не ЗначениеЗаполнено(Объект.Р_ЭлПочтаПокупателя) Тогда 
		Объект_СообщениеПользователю("Укажите email на который отправить счет", Истина, 7);
		Возврат Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда 
		Объект_СообщениеПользователю("Укажите организацию на которую выставить счет", Истина, 7);
		Возврат Ложь;
	КонецЕсли;
	
	Отправлен=Объект_ОтправитьЗапросНаСчет_Сервер();
	
	Если Отправлен=Истина Тогда
		т = "Запрос счета на оплату подписки отправлен разработчику.";
		т = т + Символы.ПС + "В ближайшее время на Ваш Email, поступит письмо с вложенным счетом на оплату.";

		Объект_СообщениеПользователю(т);
	Иначе
		т = "Не удалось запрос. Возможно у Вас устаревшая версия платформы 1С";
		т = т + Символы.ПС + "Отправьте запрос самостоятельно на адрес support@applix.ru.";
		т = т + Символы.ПС + "В тексте письма укажите название и ИНН вашей компании, и название программы на которую продлевается подписка.";
		т = т + Символы.ПС + "В теме письма укажите ""Запрос счета на оплату подписки"".";
		Объект_СообщениеПользователю(т, Истина);
	КонецЕсли;

КонецФункции

//---------------------------------------------------------------------------------------------------------------------------------------
Функция Объект_ОтправитьЗапросНаСчет_Сервер()
	Рез = Ложь;
	
	Объект_ИнициализироватьОбработку(Истина);
	
	Рез = ОбработкаОбъект.Объект_ОтправитьЗапросНаСчет();
	
	Возврат Рез;
КонецФункции




//---------------------------------------------------------------------------------------------------------------------------------------
&НаКлиенте
Функция Объект_СообщениеПользователю(тСообщение, Предупреждение=Ложь, ВремяПоказа=60)
	Рез = "";
	
	Элементы.Надпись_СообщениеПользователю.Заголовок = тСообщение;
	Если Предупреждение=Истина Тогда
		Элементы.Надпись_СообщениеПользователю.ЦветФона = WebЦвета.Томатный;
		Элементы.Надпись_СообщениеПользователю.ЦветТекста = WebЦвета.Белый;
	Иначе
		Элементы.Надпись_СообщениеПользователю.ЦветФона = Новый Цвет(204, 255, 204);//WebЦвета.Зеленый;
		Элементы.Надпись_СообщениеПользователю.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
	//Сообщить(тСообщение);
	
	//Попытка
	//	ОтключитьОбработчикОжидания("Объект_СообщениеПользователю_Очистить");
	//Исключение
	//КонецПопытки;
	//ПодключитьОбработчикОжидания("Объект_СообщениеПользователю_Очистить", ВремяПоказа, Истина);
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Функция Объект_СообщениеПользователю_Очистить()
	Элементы.Надпись_СообщениеПользователю.Заголовок = "";
	Элементы.Надпись_СообщениеПользователю.ЦветФона = Новый Цвет();
	Элементы.Надпись_СообщениеПользователю.ЦветТекста = Новый Цвет();
КонецФункции





&НаСервере
Функция Объект_ПолучитьИННОрганизации_Сервер()
	Объект_ИнициализироватьОбработку(Истина);
	Возврат ОбработкаОбъект.ПолучитьИННОрганизации(Объект.Организация);
КонецФункции



&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.Группа_ФайлРегистрации.Видимость = ЗначениеЗаполнено(Объект.ФайлРегистрации);
КонецПроцедуры


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ПодсказкаПользователю(ТекстПодсказки)

	Если ЗначениеЗаполнено(ТекстПодсказки) Тогда
		Сообщить(ТекстПодсказки);
	КонецЕсли;

КонецПроцедуры // ПодсказкаПользователю()

&НаКлиенте
Процедура Команда_Подсказка(Команда)
	Объект_ПоказатьПомощь("Организация");
	//т = "Укажите организацию, на которую будет зарегистрирована программа.";
	//ПодсказкаПользователю(т);
КонецПроцедуры

&НаКлиенте
Процедура Команда_Подсказка1(Команда)
	Объект_ПоказатьПомощь("КодРегистрации");
	//т = "Укажите в какую папку сохранить файл регистрации.";
	//ПодсказкаПользователю(т);
КонецПроцедуры

&НаКлиенте
Процедура Команда_Подсказка2(Команда)
	Объект_ПоказатьПомощь("Ключ");
	//т = "Загрузите полученный файл с ключом активации программы.";
	//ПодсказкаПользователю(т);
КонецПроцедуры

&НаКлиенте
Процедура Команда_СформироватьФайлРегистрации(Команда)
	//Если Не ЗначениеЗаполнено(Объект.ИД) Тогда
	//	Возврат;
	//КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда 
		Сообщить("Укажите организацию");
		Возврат;
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект_ПолучитьИННОрганизации_Сервер()) Тогда
		Сообщить("Укажите ИНН выбранной организации. Код не сформирован.");
		Возврат;
	КонецЕсли;
	
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Д.Фильтр = "Файлы регистрации программ applix.ru|*.apxreg";
	Если ЗначениеЗаполнено(Объект.ФайлРегистрации) Тогда 
		Д.ПолноеИмяФайла = Объект.ФайлРегистрации;
	Иначе 
		Д.ПолноеИмяФайла = Объект_СформироватьИмяФайлаРегистрации_Сервер();
	КонецЕсли;
	
	Если Д.Выбрать() Тогда
		Объект.ФайлРегистрации = Д.ПолноеИмяФайла;
		//ф = Новый Файл(Объект.ФайлРегистрации);
		//Если ф.Существует() Тогда 
		//	Если Не Вопрос("Заменить выбранный файл?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда 
		//		Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		
		Объект_СформироватьФайлРегистрации_Сервер();
		
		тКод = Новый ТекстовыйДокумент;
		тКод.УстановитьТекст(Объект.КодРегистрации);
		тКод.Записать(Объект.ФайлРегистрации, КодировкаТекста.UTF8);
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Функция Объект_СформироватьИмяФайлаРегистрации_Сервер()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПолноеИмяФайла = ОбработкаОбъект.СформироватьИмяФайлаРегистрации();
	//СимволыКУдалению = "*/+\""';:<>.,()[]{} ";
	//ПолноеИмяФайла = ""+Объект.ИД+"-"+СокрЛП(Объект.Организация.Наименование);
	//Для Н=1 По СтрДлина(СимволыКУдалению) Цикл 
	//	ПолноеИмяФайла = СтрЗаменить(ПолноеИмяФайла, Сред(СимволыКУдалению,Н,1),"");
	//КонецЦикла;
	//ПолноеИмяФайла = ПолноеИмяФайла+".apxreg";
	
	Возврат ПолноеИмяФайла;
КонецФункции


Процедура Объект_СформироватьФайлРегистрации_Сервер()
	Обработка = РеквизитФормыВЗначение("Объект");
	
	Объект.КодРегистрации = Обработка.СформироватьКодРегистрации(Истина);//Объект.БезВК);
	
	ЗначениеВРеквизитФормы(Обработка, "Объект");
КонецПроцедуры

//---------------------------------------------------------------------------------------------------------------------------------------

&НаКлиенте
Функция Объект_ПриОткрытии_Клиент()
	Рез = "";
	
	Объект_ПриОткрытии_Сервер();
	
	Объект_УстановитьЗаголовок();
	Элементы.ПанельОсновная.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Объект_УстановитьВидимостьЭлементов();
	//УстановитьВидимость();
	
	
	Возврат Рез;
КонецФункции

//---------------------------------------------------------------------------------------------------------------------------------------
Функция Объект_ПриОткрытии_Сервер()
	Рез = "";
	
	Объект_ИнициализироватьОбработку();
	
	ОбработкаОбъект.Объект_ЗаполнитьИнформациюОПрограмме();
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
	
	Возврат Рез;
КонецФункции




&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект_ПриОткрытии_Клиент();
КонецПроцедуры

&НаКлиенте
Процедура Команда_ОткрытьКаталог(Команда)
	ф = Новый Файл(Объект.ФайлРегистрации);
	Попытка
		//ЗапуститьПриложение("Explorer /e,/select,subobject," + ф.Путь);
		ЗапуститьПриложение(ф.Путь);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Команда_ЗагрузитьЛицензионныйКлюч(Команда)
	//сообщить("232323");
	Д = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Д.Фильтр = "Файлы ключей активации для программ applix.ru|*.apxkey";
	Если Д.Выбрать() Тогда
		ФайлКлюча = Д.ПолноеИмяФайла;
		Успешно = Истина;
		//Если ЗначениеЗаполнено(Объект.Р_ХранилищеНастроекПрограммы) Тогда 
			Т = Новый ТекстовыйДокумент;
			т.Прочитать(ФайлКлюча);
			КлючАктивации = т.ПолучитьТекст();
			//Сообщить(КлючАктивации);
			Успешно = Команда_ЗагрузитьЛицензионныйКлюч_ЗаписатьКлючВХранилище(КлючАктивации);
		//КонецЕсли;
		
		Если Успешно Тогда 
			//сообщить("APPLIX_RU_АктивацияПрограммы");
			Оповестить("APPLIX_RU_АктивацияПрограммы", КлючАктивации, ЭтаФорма);
			//ОповеститьОВыборе(КлючАктивации);
			Если ЭтаФорма.Открыта() Тогда 
				ЭтаФорма.Закрыть(ФайлКлюча);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция Команда_ЗагрузитьЛицензионныйКлюч_ЗаписатьКлючВХранилище(КлючАктивации)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.РегистрацияПрограммы_СохранитьКлючВХранилище(КлючАктивации);
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	Попытка
		//Объект.ИД = Параметры.ИД;
		Объект.Р_ХранилищеНастроекПрограммы = Параметры.ХранилищеНастроек;
		//Объект.Р_ИмяКонстанты = Параметры.Р_ИмяКонстанты;
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Попытка
		РФ_РежимОткрытия = Параметры.РежимОткрытия;
		Если РФ_РежимОткрытия="СчетНаОплату" Тогда
			Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная_СчетНаОплату;
		КонецЕсли;
	Исключение
		т = ОписаниеОшибки();
	КонецПопытки;
	
	Попытка
		Объект.Р_КлючАктивации = Параметры.КлючАктивации;
	Исключение
		т = ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект_ПолучитьИННОрганизации_Сервер()) Тогда
			Объект_СообщениеПользователю("Не заполнен ИНН у выбранной организации", Истина, 7);
		КонецЕсли;
	КонецЕсли;
	
	Объект_УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Команда_Подсказка3(Команда)
	Объект_ПоказатьПомощь("ВременныйКлюч");
	//т = "Установите флаг, если вам необходим ключ для тестирования программы на тестовой базе. "+ 
	//Символы.ПС+"Временный ключ активирует программу на ограниченный промежуток времени.";
	//ПодсказкаПользователю(т);
КонецПроцедуры

&НаКлиенте
Процедура Команда_НачалоРегистрации(Команда)
	Элементы.ПанельОсновная.ТекущаяСтраница = Элементы.ПанельОсновная_Регистрация;
КонецПроцедуры

&НаКлиенте
Процедура Команда_ПодсказкаЗаказ(Команда)
	Объект_ПоказатьПомощь("Заказ");
КонецПроцедуры
